# read_verilog -quiet [glob ../outdir/nv_small/vmod/nvdla/apb2csb/*.v]
# read_verilog -quiet [glob ../outdir/nv_small/vmod/nvdla/bdma/*.v]
# read_verilog -quiet [glob ../outdir/nv_small/vmod/nvdla/cacc/*.v]
# read_verilog -quiet [glob ../outdir/nv_small/vmod/nvdla/car/*.v]
# read_verilog -quiet [glob ../outdir/nv_small/vmod/nvdla/cbuf/*.v]
# read_verilog -quiet [glob ../outdir/nv_small/vmod/nvdla/cdma/*.v]
# read_verilog -quiet [glob ../outdir/nv_small/vmod/nvdla/cdp/*.v]
# read_verilog -quiet [glob ../outdir/nv_small/vmod/nvdla/cfgrom/*.v]
# read_verilog -quiet [glob ../outdir/nv_small/vmod/nvdla/cmac/*.v]
# read_verilog -quiet [glob ../outdir/nv_small/vmod/nvdla/csb_master/*.v]
# read_verilog -quiet [glob ../outdir/nv_small/vmod/nvdla/csc/*.v]
# read_verilog -quiet [glob ../outdir/nv_small/vmod/nvdla/glb/*.v]
# read_verilog -quiet [glob ../outdir/nv_small/vmod/nvdla/nocif/*.v]
# read_verilog -quiet [glob ../outdir/nv_small/vmod/nvdla/pdp/*.v]
# read_verilog -quiet [glob ../outdir/nv_small/vmod/nvdla/retiming/*.v]
# read_verilog -quiet [glob ../outdir/nv_small/vmod/nvdla/rubik/*.v]
# read_verilog -quiet [glob ../outdir/nv_small/vmod/nvdla/sdp/*.v]
# read_verilog -quiet [glob ../outdir/nv_small/vmod/nvdla/top/*.v]

# # -sourcelibdir /home/oshears/Documents/copia/code/nvdla/hw/verif/../outdir/nv_small/vmod/vlibs 
# # -include /home/oshears/Documents/copia/code/nvdla/hw/verif/../outdir/nv_small/vmod/include 
# # -include /home/oshears/Documents/copia/code/nvdla/hw/verif/../outdir/nv_small/vmod/vlibs 
# # -include_dirs {../outdir/nv_small/vmod/vlibs/ ../outdir/nv_small/vmod/vlibs}
# read_verilog -quiet [glob ../outdir/nv_small/vmod/include/*.vh]
# read_verilog -quiet [glob ../outdir/nv_small/vmod/vlibs/*.v]

# read_verilog -quiet [glob ../outdir/nv_small/vmod/rams/synth/*.v]
# read_verilog -quiet [glob ../outdir/nv_small/vmod/rams/model/*.v]

##############################################################

read_verilog -quiet ../outdir/nv_small/vmod/vlibs/assertion_header.vh
read_verilog -quiet ../outdir/nv_small/vmod/vlibs/assertion_task.vh
read_verilog -quiet ../outdir/nv_small/vmod/include/NV_HWACC_NVDLA_tick_defines.vh
read_verilog -quiet ../outdir/nv_small/vmod/include/NV_NVDLA_MCIF_define.vh
read_verilog -quiet ../outdir/nv_small/vmod/include/simulate_x_tick.vh
read_verilog -quiet ../outdir/nv_small/vmod/fifos/NV_NVDLA_CDP_DP_sumpd_fifo.v
read_verilog -quiet ../outdir/nv_small/vmod/fifos/NV_NVDLA_PDP_RDMA_lat_fifo.v
read_verilog -quiet ../outdir/nv_small/vmod/fifos/NV_NVDLA_CDP_RDMA_ro_fifo.v
read_verilog -quiet ../outdir/nv_small/vmod/fifos/NV_NVDLA_CDP_WDMA_dat_fifo.v
read_verilog -quiet ../outdir/nv_small/vmod/fifos/NV_NVDLA_PDP_WDMA_DAT_fifo.v
read_verilog -quiet ../outdir/nv_small/vmod/fifos/NV_NVDLA_SDP_NRDMA_lat_fifo_lib.v
read_verilog -quiet ../outdir/nv_small/vmod/fifos/NV_NVDLA_SDP_MRDMA_EG_lat_fifo_lib.v
read_verilog -quiet ../outdir/nv_small/vmod/fifos/NV_NVDLA_SDP_ERDMA_cq_lib.v
read_verilog -quiet ../outdir/nv_small/vmod/fifos/NV_NVDLA_CDP_DP_intpinfo_fifo.v
read_verilog -quiet ../outdir/nv_small/vmod/fifos/NV_NVDLA_SDP_ERDMA_lat_fifo_lib.v
read_verilog -quiet ../outdir/nv_small/vmod/fifos/NV_NVDLA_SDP_MRDMA_cq_lib.v
read_verilog -quiet ../outdir/nv_small/vmod/fifos/NV_NVDLA_PDP_RDMA_ro_fifo.v
read_verilog -quiet ../outdir/nv_small/vmod/fifos/NV_NVDLA_PDP_SDPIN_ro_fifo.v
read_verilog -quiet ../outdir/nv_small/vmod/fifos/NV_NVDLA_CDP_DP_data_fifo.v
read_verilog -quiet ../outdir/nv_small/vmod/fifos/NV_NVDLA_SDP_NRDMA_cq_lib.v
read_verilog -quiet ../outdir/nv_small/vmod/fifos/NV_NVDLA_SDP_BRDMA_lat_fifo_lib.v
read_verilog -quiet ../outdir/nv_small/vmod/fifos/NV_NVDLA_CDMA_WT_8ATMM_fifo.v
read_verilog -quiet ../outdir/nv_small/vmod/fifos/NV_NVDLA_SDP_BRDMA_cq_lib.v
read_verilog -quiet ../outdir/nv_small/vmod/fifos/NV_NVDLA_CDP_RDMA_lat_fifo.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/retiming/NV_NVDLA_RT_csc2cmac_b.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/retiming/NV_NVDLA_RT_sdp2nocif.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/retiming/NV_NVDLA_RT_csc2cmac_a.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/retiming/NV_NVDLA_RT_csb2cacc.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/retiming/NV_NVDLA_RT_cmac_a2cacc.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/retiming/NV_NVDLA_RT_cacc2glb.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/retiming/NV_NVDLA_RT_csb2cmac.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/retiming/NV_NVDLA_RT_cmac_b2cacc.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/csc/NV_NVDLA_csc.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/csc/NV_NVDLA_CSC_regfile.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/csc/NV_NVDLA_CSC_pra_cell.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/csc/NV_NVDLA_CSC_wl.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/csc/NV_NVDLA_CSC_single_reg.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/csc/NV_NVDLA_CSC_dual_reg.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/csc/NV_NVDLA_CSC_slcg.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/csc/NV_NVDLA_CSC_WL_dec.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/csc/NV_NVDLA_CSC_dl.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/csc/NV_NVDLA_CSC_sg.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/csc/NV_NVDLA_CSC_SG_wt_fifo.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/csc/NV_NVDLA_CSC_SG_dat_fifo.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/apb2csb/NV_NVDLA_apb2csb.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/cacc/NV_NVDLA_CACC_delivery_ctrl.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/cacc/NV_NVDLA_CACC_dual_reg.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/cacc/NV_NVDLA_CACC_calculator.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/cacc/NV_NVDLA_CACC_delivery_buffer.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/cacc/NV_NVDLA_CACC_single_reg.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/cacc/NV_NVDLA_CACC_assembly_buffer.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/cacc/NV_NVDLA_CACC_slcg.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/cacc/NV_NVDLA_cacc.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/cacc/NV_NVDLA_CACC_CALC_fp_48b.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/cacc/NV_NVDLA_CACC_CALC_int8.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/cacc/NV_NVDLA_CACC_CALC_int16.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/cacc/NV_NVDLA_CACC_assembly_ctrl.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/cacc/NV_NVDLA_CACC_regfile.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/cdma/NV_NVDLA_CDMA_IMG_sg.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/cdma/NV_NVDLA_cdma.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/cdma/NV_NVDLA_CDMA_regfile.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/cdma/NV_NVDLA_CDMA_dual_reg.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/cdma/NV_NVDLA_CDMA_wt.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/cdma/NV_NVDLA_CDMA_single_reg.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/cdma/NV_NVDLA_CDMA_cvt.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/cdma/NV_NVDLA_CDMA_WT_sp_arb.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/cdma/NV_NVDLA_CDMA_slcg.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/cdma/NV_NVDLA_CDMA_WT_wgs_fifo.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/cdma/NV_NVDLA_CDMA_IMG_pack.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/cdma/NV_NVDLA_CDMA_WT_fifo.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/cdma/NV_NVDLA_CDMA_wg.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/cdma/NV_NVDLA_CDMA_CVT_cell.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/cdma/NV_NVDLA_CDMA_IMG_fifo.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/cdma/NV_NVDLA_CDMA_WG_fifo.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/cdma/NV_NVDLA_CDMA_status.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/cdma/NV_NVDLA_CDMA_IMG_sg2pack_fifo.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/cdma/NV_NVDLA_CDMA_dc.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/cdma/NV_NVDLA_CDMA_shared_buffer.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/cdma/NV_NVDLA_CDMA_img.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/cdma/NV_NVDLA_CDMA_IMG_ctrl.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/cdma/NV_NVDLA_CDMA_dma_mux.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/cdma/NV_NVDLA_CDMA_WT_wrr_arb.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/cdma/NV_NVDLA_CDMA_DC_fifo.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/csb_master/NV_NVDLA_CSB_MASTER_falcon2csb_fifo.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/csb_master/NV_NVDLA_csb_master.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/csb_master/NV_NVDLA_CSB_MASTER_csb2falcon_fifo.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/rubik/NV_NVDLA_RUBIK_rf_wcmd.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/rubik/NV_NVDLA_RUBIK_fifo.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/rubik/NV_NVDLA_RUBIK_wrdma_cmd.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/rubik/NV_NVDLA_RUBIK_dr2drc.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/rubik/NV_NVDLA_RUBIK_single_reg.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/rubik/NV_NVDLA_RUBIK_rf_core.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/rubik/NV_NVDLA_RUBIK_dual_reg.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/rubik/NV_NVDLA_RUBIK_rf_rcmd.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/rubik/NV_NVDLA_RUBIK_rf_ctrl.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/rubik/NV_NVDLA_RUBIK_wrdma_data.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/rubik/NV_NVDLA_RUBIK_dma.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/rubik/NV_NVDLA_rubik.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/rubik/NV_NVDLA_RUBIK_seq_gen.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/rubik/NV_NVDLA_RUBIK_intr.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/rubik/NV_NVDLA_RUBIK_slcg.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/rubik/NV_NVDLA_RUBIK_regfile.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/rubik/NV_NVDLA_RUBIK_wr_req.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/cfgrom/NV_NVDLA_cfgrom.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/cfgrom/NV_NVDLA_CFGROM_rom.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/bdma/NV_NVDLA_BDMA_gate.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/bdma/NV_NVDLA_BDMA_reg.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/bdma/NV_NVDLA_BDMA_store.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/bdma/NV_NVDLA_BDMA_cq.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/bdma/NV_NVDLA_bdma.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/bdma/NV_NVDLA_BDMA_load.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/bdma/NV_NVDLA_BDMA_csb.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/top/NV_NVDLA_partition_m.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/top/NV_nvdla.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/top/NV_NVDLA_partition_c.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/top/NV_NVDLA_partition_o.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/top/NV_NVDLA_partition_p.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/top/NV_NVDLA_partition_a.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/cdp/NV_NVDLA_CDP_RDMA_reg.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/cdp/NV_NVDLA_CDP_wdma.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/cdp/NV_NVDLA_CDP_slcg.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/cdp/NV_NVDLA_CDP_DP_sum.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/cdp/NV_NVDLA_CDP_DP_mul.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/cdp/int_sum_block_tp1.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/cdp/NV_NVDLA_CDP_DP_bufferin_tp1.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/cdp/NV_NVDLA_CDP_DP_INTP_unit.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/cdp/NV_NVDLA_CDP_dp.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/cdp/NV_NVDLA_CDP_rdma.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/cdp/NV_NVDLA_CDP_reg.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/cdp/NV_NVDLA_CDP_DP_LUT_ctrl.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/cdp/NV_NVDLA_CDP_RDMA_ig.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/cdp/NV_NVDLA_CDP_RDMA_REG_single.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/cdp/NV_NVDLA_CDP_RDMA_cq.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/cdp/int_sum_block.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/cdp/NV_NVDLA_cdp.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/cdp/NV_NVDLA_CDP_DP_bufferin.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/cdp/NV_NVDLA_CDP_DP_lut.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/cdp/NV_NVDLA_CDP_RDMA_REG_dual.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/cdp/fp_sum_block.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/cdp/NV_NVDLA_CDP_RDMA_eg.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/cdp/fp_format_cvt.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/cdp/NV_NVDLA_CDP_DP_intp.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/cdp/NV_NVDLA_CDP_DP_cvtout.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/cdp/NV_NVDLA_CDP_DP_nan.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/cdp/NV_NVDLA_CDP_REG_single.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/cdp/NV_NVDLA_CDP_DP_cvtin.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/cdp/NV_NVDLA_CDP_DP_MUL_unit.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/cdp/NV_NVDLA_CDP_DP_syncfifo.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/cdp/NV_NVDLA_CDP_DP_LUT_CTRL_unit.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/cdp/NV_NVDLA_CDP_REG_dual.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/glb/NV_NVDLA_GLB_csb.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/glb/NV_NVDLA_glb.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/glb/NV_NVDLA_GLB_CSB_reg.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/glb/NV_NVDLA_GLB_ic.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/glb/NV_NVDLA_GLB_fc.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/sdp/NV_NVDLA_SDP_rdma.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/sdp/NV_NVDLA_SDP_MRDMA_EG_din.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/sdp/NV_NVDLA_SDP_RDMA_pack.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/sdp/NV_NVDLA_SDP_CORE_Y_inp.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/sdp/NV_NVDLA_sdp.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/sdp/NV_NVDLA_SDP_HLS_Y_int_mul.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/sdp/NV_NVDLA_SDP_ERDMA_eg.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/sdp/NV_NVDLA_SDP_ERDMA_EG_ro.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/sdp/NV_NVDLA_SDP_HLS_C_int.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/sdp/NV_NVDLA_SDP_HLS_Y_int_alu.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/sdp/NV_NVDLA_SDP_HLS_prelu.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/sdp/NV_NVDLA_SDP_cmux.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/sdp/NV_NVDLA_SDP_CORE_Y_dmapack.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/sdp/NV_NVDLA_SDP_WDMA_DAT_in.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/sdp/NV_NVDLA_SDP_mrdma.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/sdp/NV_NVDLA_SDP_ERDMA_cq.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/sdp/NV_NVDLA_SDP_MRDMA_EG_dout.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/sdp/NV_NVDLA_SDP_ERDMA_ig.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/sdp/NV_NVDLA_SDP_HLS_relu.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/sdp/NV_NVDLA_SDP_BRDMA_eg.v
# read_verilog -quiet ../outdir/nv_small/vmod/nvdla/sdp/NV_NVDLA_SDP_CORE_Y_lut.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/sdp/NV_NVDLA_SDP_CORE_Y_cvt.v
# read_verilog -quiet ../outdir/nv_small/vmod/nvdla/sdp/NV_NVDLA_SDP_CORE_y.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/sdp/NV_NVDLA_SDP_NRDMA_eg.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/sdp/NV_NVDLA_SDP_WDMA_gate.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/sdp/NV_NVDLA_SDP_WDMA_unpack.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/sdp/NV_NVDLA_SDP_BRDMA_gate.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/sdp/NV_NVDLA_SDP_ERDMA_lat_fifo.v
# read_verilog -quiet ../outdir/nv_small/vmod/nvdla/sdp/NV_NVDLA_SDP_HLS_Y_idx_top.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/sdp/NV_NVDLA_SDP_wdma.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/sdp/NV_NVDLA_SDP_HLS_c.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/sdp/NV_NVDLA_SDP_MRDMA_eg.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/sdp/NV_NVDLA_SDP_CORE_c.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/sdp/NV_NVDLA_SDP_ERDMA_gate.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/sdp/NV_NVDLA_SDP_BRDMA_cq.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/sdp/NV_NVDLA_SDP_HLS_Y_int_idx.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/sdp/NV_NVDLA_SDP_HLS_lut_line.v
# read_verilog -quiet ../outdir/nv_small/vmod/nvdla/sdp/NV_NVDLA_SDP_HLS_Y_inp_top.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/sdp/NV_NVDLA_SDP_BRDMA_ig.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/sdp/NV_NVDLA_SDP_RDMA_unpack.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/sdp/NV_NVDLA_SDP_CORE_gate.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/sdp/NV_NVDLA_SDP_NRDMA_cq.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/sdp/NV_NVDLA_SDP_BRDMA_lat_fifo.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/sdp/NV_NVDLA_SDP_HLS_x1_int.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/sdp/NV_NVDLA_SDP_MRDMA_cq.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/sdp/NV_NVDLA_SDP_CORE_pack.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/sdp/NV_NVDLA_SDP_HLS_X_int_relu.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/sdp/NV_NVDLA_SDP_NRDMA_gate.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/sdp/NV_NVDLA_SDP_HLS_Y_int_inp.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/sdp/NV_NVDLA_SDP_WDMA_DAT_out.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/sdp/NV_NVDLA_SDP_CORE_Y_core.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/sdp/NV_NVDLA_SDP_CORE_Y_dpunpack.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/sdp/NV_NVDLA_SDP_WDMA_dmaif.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/sdp/NV_NVDLA_SDP_HLS_X_int_trt.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/sdp/NV_NVDLA_SDP_WDMA_intr.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/sdp/NV_NVDLA_SDP_core.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/sdp/NV_NVDLA_SDP_MRDMA_ig.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/sdp/NV_NVDLA_SDP_brdma.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/sdp/NV_NVDLA_SDP_HLS_X_int_alu.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/sdp/NV_NVDLA_SDP_MRDMA_EG_cmd.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/sdp/NV_NVDLA_SDP_HLS_x2_int.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/sdp/NV_NVDLA_SDP_CORE_x.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/sdp/NV_NVDLA_SDP_REG_dual.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/sdp/NV_NVDLA_SDP_REG_single.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/sdp/NV_NVDLA_SDP_HLS_sync2data.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/sdp/NV_NVDLA_SDP_CORE_Y_idx.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/sdp/NV_NVDLA_SDP_RDMA_ig.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/sdp/NV_NVDLA_SDP_RDMA_EG_ro.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/sdp/NV_NVDLA_SDP_MRDMA_gate.v
# read_verilog -quiet ../outdir/nv_small/vmod/nvdla/sdp/NV_NVDLA_SDP_HLS_Y_int_core.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/sdp/NV_NVDLA_SDP_RDMA_eg.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/sdp/NV_NVDLA_SDP_nrdma.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/sdp/NV_NVDLA_SDP_CORE_unpack.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/sdp/NV_NVDLA_SDP_erdma.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/sdp/NV_NVDLA_SDP_reg.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/sdp/NV_NVDLA_SDP_RDMA_reg.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/sdp/NV_NVDLA_SDP_RDMA_REG_dual.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/sdp/NV_NVDLA_SDP_HLS_X_int_mul.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/sdp/NV_NVDLA_SDP_NRDMA_ig.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/sdp/NV_NVDLA_SDP_WDMA_cmd.v
# read_verilog -quiet ../outdir/nv_small/vmod/nvdla/sdp/NV_NVDLA_SDP_HLS_Y_cvt_top.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/sdp/NV_NVDLA_SDP_HLS_Y_int_cvt.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/sdp/NV_NVDLA_SDP_HLS_lut_expn.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/sdp/NV_NVDLA_SDP_BRDMA_EG_ro.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/sdp/NV_NVDLA_SDP_RDMA_REG_single.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/sdp/NV_NVDLA_SDP_CORE_Y_dppack.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/sdp/NV_NVDLA_SDP_NRDMA_EG_ro.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/sdp/NV_NVDLA_SDP_WDMA_dat.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/sdp/NV_NVDLA_SDP_NRDMA_lat_fifo.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/sdp/NV_NVDLA_SDP_RDMA_dmaif.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/pdp/NV_NVDLA_PDP_wdma.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/pdp/NV_NVDLA_PDP_WDMA_dat.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/pdp/NV_NVDLA_PDP_CORE_preproc.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/pdp/NV_NVDLA_PDP_nan.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/pdp/NV_NVDLA_PDP_CORE_cal1d.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/pdp/fp16_4add.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/pdp/NV_NVDLA_PDP_CORE_cal2d.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/pdp/NV_NVDLA_PDP_reg.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/pdp/cal1d_fp16_pool_sum.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/pdp/NV_NVDLA_PDP_REG_single.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/pdp/NV_NVDLA_PDP_CORE_unit1d.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/pdp/NV_NVDLA_PDP_slcg.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/pdp/NV_NVDLA_PDP_RDMA_REG_single.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/pdp/NV_NVDLA_PDP_rdma.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/pdp/NV_NVDLA_PDP_RDMA_cq.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/pdp/NV_NVDLA_PDP_WDMA_cmd.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/pdp/NV_NVDLA_pdp.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/pdp/NV_NVDLA_PDP_RDMA_reg.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/pdp/NV_NVDLA_PDP_REG_dual.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/pdp/NV_NVDLA_PDP_core.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/pdp/NV_NVDLA_PDP_RDMA_REG_dual.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/pdp/NV_NVDLA_PDP_RDMA_eg.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/pdp/NV_NVDLA_PDP_RDMA_ig.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/cbuf/NV_NVDLA_cbuf.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/cmac/NV_NVDLA_CMAC_CORE_MAC_mul.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/cmac/NV_NVDLA_CMAC_CORE_slcg.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/cmac/NV_NVDLA_CMAC_CORE_cfg.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/cmac/NV_NVDLA_cmac.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/cmac/NV_NVDLA_CMAC_CORE_mac.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/cmac/NV_NVDLA_CMAC_CORE_MAC_exp.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/cmac/NV_NVDLA_CMAC_reg.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/cmac/NV_NVDLA_CMAC_CORE_rt_in.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/cmac/NV_NVDLA_CMAC_core.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/cmac/NV_NVDLA_CMAC_CORE_rt_out.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/cmac/NV_NVDLA_CMAC_CORE_active.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/cmac/NV_NVDLA_CMAC_CORE_MAC_nan.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/cmac/NV_NVDLA_CMAC_REG_dual.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/cmac/NV_NVDLA_CMAC_REG_single.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/nocif/NV_NVDLA_CVIF_CSB_reg.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/nocif/NV_NVDLA_CVIF_READ_eg.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/nocif/NV_NVDLA_CVIF_WRITE_IG_bpt.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/nocif/NV_NVDLA_mcif.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/nocif/NV_NVDLA_CVIF_READ_ig.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/nocif/NV_NVDLA_CVIF_write.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/nocif/NV_NVDLA_NOCIF_DRAM_READ_cq.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/nocif/NV_NVDLA_DMAIF_rdreq.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/nocif/NV_NVDLA_CVIF_READ_IG_spt.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/nocif/NV_NVDLA_NOCIF_DRAM_READ_IG_arb.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/nocif/NV_NVDLA_CVIF_WRITE_IG_cvt.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/nocif/NV_NVDLA_CVIF_READ_cq.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/nocif/NV_NVDLA_NOCIF_DRAM_WRITE_ig.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/nocif/NV_NVDLA_CVIF_WRITE_eg.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/nocif/NV_NVDLA_CVIF_WRITE_IG_spt.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/nocif/NV_NVDLA_CVIF_csb.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/nocif/NV_NVDLA_MCIF_WRITE_IG_cvt.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/nocif/NV_NVDLA_MCIF_csb.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/nocif/NV_NVDLA_NOCIF_DRAM_read.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/nocif/NV_NVDLA_MCIF_read.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/nocif/NV_NVDLA_MCIF_READ_IG_bpt.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/nocif/NV_NVDLA_MCIF_WRITE_ig.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/nocif/NV_NVDLA_NOCIF_DRAM_WRITE_IG_bpt.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/nocif/NV_NVDLA_NOCIF_DRAM_WRITE_IG_spt.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/nocif/NV_NVDLA_CVIF_read.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/nocif/NV_NVDLA_MCIF_write.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/nocif/NV_NVDLA_MCIF_READ_IG_spt.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/nocif/NV_NVDLA_DMAIF_rdrsp.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/nocif/NV_NVDLA_MCIF_WRITE_IG_bpt.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/nocif/NV_NVDLA_CVIF_READ_IG_bpt.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/nocif/NV_NVDLA_CVIF_READ_IG_arb.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/nocif/NV_NVDLA_NOCIF_DRAM_WRITE_IG_arb.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/nocif/NV_NVDLA_DMAIF_wr.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/nocif/NV_NVDLA_NOCIF_DRAM_WRITE_IG_cvt.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/nocif/NV_NVDLA_MCIF_WRITE_IG_spt.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/nocif/NV_NVDLA_MCIF_READ_IG_arb.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/nocif/NV_NVDLA_CVIF_WRITE_IG_arb.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/nocif/NV_NVDLA_NOCIF_DRAM_write.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/nocif/NV_NVDLA_NOCIF_DRAM_WRITE_eg.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/nocif/NV_NVDLA_nocif.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/nocif/NV_NVDLA_CVIF_READ_IG_cvt.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/nocif/NV_NVDLA_MCIF_WRITE_eg.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/nocif/NV_NVDLA_MCIF_READ_IG_cvt.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/nocif/NV_NVDLA_NOCIF_DRAM_READ_ig.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/nocif/NV_NVDLA_NOCIF_DRAM_WRITE_cq.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/nocif/NV_NVDLA_MCIF_CSB_reg.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/nocif/NV_NVDLA_NOCIF_DRAM_READ_IG_bpt.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/nocif/NV_NVDLA_MCIF_WRITE_cq.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/nocif/NV_NVDLA_MCIF_WRITE_IG_arb.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/nocif/NV_NVDLA_MCIF_READ_cq.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/nocif/NV_NVDLA_cvif.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/nocif/NV_NVDLA_CVIF_WRITE_cq.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/nocif/NV_NVDLA_XXIF_libs.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/nocif/NV_NVDLA_NOCIF_DRAM_READ_IG_spt.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/nocif/NV_NVDLA_MCIF_READ_eg.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/nocif/NV_NVDLA_NOCIF_DRAM_READ_eg.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/nocif/NV_NVDLA_NOCIF_DRAM_READ_IG_cvt.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/nocif/NV_NVDLA_MCIF_READ_ig.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/nocif/NV_NVDLA_NOCIF_dram.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/nocif/NV_NVDLA_CVIF_WRITE_ig.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/car/NV_NVDLA_sync3d_s.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/car/NV_NVDLA_reset.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/car/NV_NVDLA_ssync3d.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/car/NV_NVDLA_sync3d.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/car/NV_NVDLA_sync3d_c.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/car/NV_NVDLA_core_reset.v
read_verilog -quiet ../outdir/nv_small/vmod/nvdla/car/NV_NVDLA_ssync3d_c.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/synth/nv_ram_rwsp_8x257.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/synth/nv_ram_rws_128x128.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/synth/nv_ram_rws_64x18_logic.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/synth/nv_ram_rwsp_160x65.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/synth/nv_ram_rwsp_256x14_logic.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/synth/nv_ram_rwsthp_80x15_logic.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/synth/nv_ram_rws_32x32_logic.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/synth/nv_ram_rws_64x128_logic.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/synth/nv_ram_rws_32x16.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/synth/nv_ram_rwsp_32x129.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/synth/nv_ram_rwsthp_20x4.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/synth/nv_ram_rws_512x64_logic.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/synth/nv_ram_rws_64x32.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/synth/nv_ram_rwsthp_19x80.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/synth/nv_ram_rwsp_64x129.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/synth/nv_ram_rws_32x512_logic.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/synth/nv_ram_rwsp_61x64.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/synth/nv_ram_rws_128x64.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/synth/nv_ram_rwsp_64x129_logic.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/synth/nv_ram_rws_16x128_logic.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/synth/nv_ram_rwsp_16x14.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/synth/nv_ram_rws_16x256_logic.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/synth/nv_ram_rwsp_8x65_logic.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/synth/nv_ram_rwsp_128x11.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/synth/nv_ram_rws_512x512.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/synth/nv_ram_rwsp_245x514_logic.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/synth/nv_ram_rwsthp_60x168_logic.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/synth/nv_ram_rwsp_256x11.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/synth/nv_ram_rwsthp_80x18.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/synth/nv_ram_rwsp_20x289_logic.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/synth/nv_ram_rwsthp_80x72.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/synth/nv_ram_rws_64x512.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/synth/nv_ram_rws_256x64.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/synth/nv_ram_rwsp_32x32.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/synth/nv_ram_rws_128x512.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/synth/nv_ram_rwsp_80x256_logic.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/synth/nv_ram_rws_128x512_logic.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/synth/nv_ram_rws_128x256.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/synth/nv_ram_rws_32x272_logic.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/synth/nv_ram_rwsp_20x289.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/synth/nv_ram_rwsthp_60x42.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/synth/nv_ram_rws_256x3_logic.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/synth/nv_ram_rwsp_32x256_logic.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/synth/nv_ram_rws_64x64_logic.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/synth/nv_ram_rwsp_80x14.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/synth/nv_ram_rws_512x512_logic.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/synth/nv_ram_rwsp_16x256.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/synth/nv_ram_rws_64x10.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/synth/nv_ram_rws_32x64_logic.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/synth/nv_ram_rwsp_160x514_logic.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/synth/nv_ram_rwsp_8x257_logic.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/synth/nv_ram_rwsp_160x16.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/synth/nv_ram_rws_128x32.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/synth/nv_ram_rwsthp_60x21_logic.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/synth/nv_ram_rwsthp_80x9_logic.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/synth/nv_ram_rwsthp_80x18_logic.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/synth/nv_ram_rws_64x32_logic.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/synth/nv_ram_rwsp_80x65_logic.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/synth/nv_ram_rwsp_61x64_logic.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/synth/nv_ram_rwsp_80x256.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/synth/nv_ram_rwsp_61x65_logic.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/synth/nv_ram_rwsp_61x514_logic.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/synth/nv_ram_rws_128x18_logic.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/synth/nv_ram_rws_64x116.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/synth/nv_ram_rwsp_128x11_logic.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/synth/nv_ram_rws_16x272.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/synth/nv_ram_rwsthp_20x16.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/synth/nv_ram_rwsp_61x65.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/synth/nv_ram_rws_32x16_logic.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/synth/nv_ram_rws_256x128.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/synth/nv_ram_rwsthp_80x17.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/synth/nv_ram_rws_64x18.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/synth/nv_ram_rws_128x60.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/synth/nv_ram_rws_256x7.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/synth/nv_ram_rws_16x128.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/synth/nv_ram_rwsthp_20x32.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/synth/nv_ram_rwsthp_19x32.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/synth/nv_ram_rws_32x272.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/synth/nv_ram_rws_128x64_logic.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/synth/nv_ram_rwsthp_80x17_logic.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/synth/nv_ram_rwsp_4x128.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/synth/nv_ram_rwsthp_80x36_logic.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/synth/nv_ram_rwsp_61x514.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/synth/nv_ram_rwsp_4x64.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/synth/nv_ram_rwsp_245x514.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/synth/nv_ram_rws_64x512_logic.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/synth/nv_ram_rws_64x1088.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/synth/nv_ram_rwsthp_60x84.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/synth/nv_ram_rwsp_4x128_logic.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/synth/nv_ram_rwsp_128x257_logic.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/synth/nv_ram_rwsthp_19x4.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/synth/nv_ram_rwst_256x8_logic.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/synth/nv_ram_rwsp_64x16.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/synth/nv_ram_rws_512x128_logic.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/synth/nv_ram_rwsp_256x16_logic.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/synth/nv_ram_rwsp_160x16_logic.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/synth/nv_ram_rws_64x64.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/synth/nv_ram_rwsthp_80x9.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/synth/nv_ram_rws_512x256_logic.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/synth/nv_ram_rws_128x60_logic.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/synth/nv_ram_rwsp_16x65.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/synth/nv_ram_rwsp_8x65.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/synth/nv_ram_rws_256x128_logic.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/synth/nv_ram_rws_256x3.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/synth/nv_ram_rws_128x18.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/synth/nv_ram_rwsp_16x256_logic.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/synth/nv_ram_rws_256x512_logic.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/synth/nv_ram_rws_512x128.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/synth/nv_ram_rwsp_32x256.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/synth/nv_ram_rwsp_8x129.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/synth/nv_ram_rwsp_16x16_logic.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/synth/nv_ram_rwsthp_60x84_logic.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/synth/nv_ram_rwsp_16x14_logic.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/synth/nv_ram_rws_16x64.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/synth/nv_ram_rwsthp_80x15.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/synth/nv_ram_rwsp_256x14.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/synth/nv_ram_rwsp_256x257_logic.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/synth/nv_ram_rwsp_80x16.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/synth/nv_ram_rws_64x116_logic.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/synth/nv_ram_rwsp_80x16_logic.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/synth/nv_ram_rws_32x256_logic.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/synth/nv_ram_rws_32x32.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/synth/nv_ram_rws_16x64_logic.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/synth/nv_ram_rws_64x10_logic.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/synth/nv_ram_rws_256x256_logic.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/synth/nv_ram_rws_32x64.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/synth/nv_ram_rws_128x256_logic.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/synth/nv_ram_rws_64x256.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/synth/nv_ram_rwsp_64x16_logic.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/synth/nv_ram_rwsp_64x14.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/synth/nv_ram_rws_128x32_logic.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/synth/nv_ram_rwsthp_20x32_logic.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/synth/nv_ram_rwsthp_60x21.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/synth/nv_ram_rws_128x128_logic.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/synth/nv_ram_rwsp_8x129_logic.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/synth/nv_ram_rwsp_128x6.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/synth/nv_ram_rws_32x128.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/synth/nv_ram_rwsthp_60x42_logic.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/synth/nv_ram_rwsp_4x64_logic.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/synth/nv_ram_rwsp_32x129_logic.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/synth/nv_ram_rws_32x544.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/synth/nv_ram_rwsp_256x257.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/synth/nv_ram_rwsp_80x514.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/synth/nv_ram_rwsthp_80x36.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/synth/nv_ram_rwsp_256x11_logic.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/synth/nv_ram_rwsp_256x16.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/synth/nv_ram_rwsthp_60x168.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/synth/nv_ram_rws_64x256_logic.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/synth/nv_ram_rwsthp_20x4_logic.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/synth/nv_ram_rws_32x512.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/synth/nv_ram_rwsp_32x32_logic.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/synth/nv_ram_rws_16x272_logic.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/synth/nv_ram_rwsthp_20x8.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/synth/nv_ram_rws_32x128_logic.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/synth/nv_ram_rwsp_80x14_logic.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/synth/nv_ram_rwsp_64x14_logic.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/synth/nv_ram_rws_256x256.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/synth/nv_ram_rws_32x256.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/synth/nv_ram_rwsp_16x65_logic.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/synth/nv_ram_rwsp_128x6_logic.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/synth/nv_ram_rwsthp_20x8_logic.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/synth/nv_ram_rws_512x64.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/synth/nv_ram_rws_256x7_logic.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/synth/nv_ram_rwsthp_20x16_logic.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/synth/nv_ram_rws_32x768.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/synth/nv_ram_rws_256x64_logic.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/synth/nv_ram_rws_64x1024_logic.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/synth/nv_ram_rwsthp_19x80_logic.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/synth/nv_ram_rwsp_16x16.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/synth/nv_ram_rws_256x512.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/synth/nv_ram_rws_32x544_logic.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/synth/nv_ram_rwsp_80x514_logic.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/synth/nv_ram_rws_32x768_logic.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/synth/nv_ram_rws_16x256.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/synth/nv_ram_rwsthp_80x72_logic.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/synth/nv_ram_rwsp_160x514.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/synth/nv_ram_rwsp_80x65.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/synth/nv_ram_rwsp_160x65_logic.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/synth/nv_ram_rwst_256x8.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/synth/nv_ram_rws_64x128.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/synth/nv_ram_rws_64x1088_logic.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/synth/nv_ram_rws_512x256.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/synth/nv_ram_rwsp_128x257.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/synth/nv_ram_rws_64x1024.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/fpga/small_rams/nv_ram_rwsp_160x65.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/fpga/small_rams/nv_ram_rws_32x16.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/fpga/small_rams/nv_ram_rwsthp_19x80.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/fpga/small_rams/nv_ram_rwsp_61x64.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/fpga/small_rams/nv_ram_rws_128x64.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/fpga/small_rams/nv_ram_rwsp_128x11.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/fpga/small_rams/nv_ram_rws_512x512.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/fpga/small_rams/nv_ram_rwsp_256x11.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/fpga/small_rams/nv_ram_rwsthp_80x72.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/fpga/small_rams/nv_ram_rws_256x64.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/fpga/small_rams/nv_ram_rwsp_32x32.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/fpga/small_rams/nv_ram_rws_128x256.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/fpga/small_rams/nv_ram_rwsp_20x289.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/fpga/small_rams/nv_ram_rwsp_80x14.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/fpga/small_rams/nv_ram_rws_64x10.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/fpga/small_rams/nv_ram_rwsp_160x16.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/fpga/small_rams/nv_ram_rwsp_80x256.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/fpga/small_rams/nv_ram_rws_64x116.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/fpga/small_rams/nv_ram_rws_16x272.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/fpga/small_rams/nv_ram_rwsp_61x65.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/fpga/small_rams/nv_ram_rws_64x18.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/fpga/small_rams/nv_ram_rws_256x7.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/fpga/small_rams/nv_ram_rwsthp_19x32.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/fpga/small_rams/nv_ram_rwsp_61x514.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/fpga/small_rams/nv_ram_rwsp_245x514.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/fpga/small_rams/nv_ram_rws_64x1088.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/fpga/small_rams/nv_ram_rwsthp_19x4.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/fpga/small_rams/nv_ram_rwsthp_80x9.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/fpga/small_rams/nv_ram_rwsp_8x65.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/fpga/small_rams/nv_ram_rws_256x3.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/fpga/small_rams/nv_ram_rws_128x18.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/fpga/small_rams/nv_ram_rws_16x64.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/fpga/small_rams/nv_ram_rwsthp_80x15.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/fpga/small_rams/nv_ram_rwsp_80x16.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/fpga/small_rams/nv_ram_rwsthp_60x21.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/fpga/small_rams/nv_ram_rwsp_128x6.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/fpga/small_rams/nv_ram_rws_32x544.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/fpga/small_rams/nv_ram_rwsp_80x514.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/fpga/small_rams/nv_ram_rwsthp_60x168.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/fpga/small_rams/nv_ram_rws_32x512.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/fpga/small_rams/nv_ram_rws_512x64.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/fpga/small_rams/nv_ram_rws_32x768.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/fpga/small_rams/nv_ram_rws_256x512.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/fpga/small_rams/nv_ram_rws_16x256.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/fpga/small_rams/nv_ram_rwsp_160x514.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/fpga/small_rams/nv_ram_rwsp_80x65.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/fpga/small_rams/nv_ram_rwst_256x8.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/fpga/small_rams/nv_ram_rws_512x256.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/fpga/small_rams/nv_ram_rws_64x1024.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/fpga/model/nv_ram_rwsp_8x257.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/fpga/model/nv_ram_rws_128x128.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/fpga/model/nv_ram_rwsp_160x65.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/fpga/model/nv_ram_rws_32x16.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/fpga/model/nv_ram_rwsp_32x129.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/fpga/model/nv_ram_rwsthp_20x4.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/fpga/model/nv_ram_rws_64x32.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/fpga/model/nv_ram_rwsthp_19x80.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/fpga/model/nv_ram_rwsp_64x129.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/fpga/model/nv_ram_rwsp_61x64.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/fpga/model/nv_ram_rws_128x64.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/fpga/model/nv_ram_rwsp_16x14.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/fpga/model/nv_ram_rwsp_128x11.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/fpga/model/nv_ram_rws_512x512.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/fpga/model/nv_ram_rwsp_256x11.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/fpga/model/nv_ram_rwsthp_80x18.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/fpga/model/nv_ram_rwsthp_80x72.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/fpga/model/nv_ram_rws_64x512.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/fpga/model/nv_ram_rws_256x64.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/fpga/model/nv_ram_rwsp_32x32.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/fpga/model/nv_ram_rws_128x512.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/fpga/model/nv_ram_rws_128x256.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/fpga/model/nv_ram_rwsp_20x289.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/fpga/model/nv_ram_rwsthp_60x42.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/fpga/model/nv_ram_rwsp_80x14.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/fpga/model/nv_ram_rwsp_16x256.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/fpga/model/nv_ram_rws_64x10.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/fpga/model/nv_ram_rwsp_160x16.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/fpga/model/nv_ram_rws_128x32.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/fpga/model/nv_ram_rwsp_80x256.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/fpga/model/nv_ram_rws_64x116.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/fpga/model/nv_ram_rws_16x272.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/fpga/model/nv_ram_rwsthp_20x16.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/fpga/model/nv_ram_rwsp_61x65.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/fpga/model/nv_ram_rws_256x128.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/fpga/model/nv_ram_rwsthp_80x17.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/fpga/model/nv_ram_rws_64x18.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/fpga/model/nv_ram_rws_128x60.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/fpga/model/nv_ram_rws_256x7.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/fpga/model/nv_ram_rws_16x128.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/fpga/model/nv_ram_rwsthp_20x32.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/fpga/model/nv_ram_rwsthp_19x32.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/fpga/model/nv_ram_rws_32x272.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/fpga/model/nv_ram_rwsp_4x128.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/fpga/model/nv_ram_rwsp_61x514.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/fpga/model/nv_ram_rwsp_4x64.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/fpga/model/nv_ram_rwsp_245x514.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/fpga/model/nv_ram_rws_64x1088.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/fpga/model/nv_ram_rwsthp_60x84.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/fpga/model/nv_ram_rwsthp_19x4.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/fpga/model/nv_ram_rwsp_64x16.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/fpga/model/nv_ram_rws_64x64.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/fpga/model/nv_ram_rwsthp_80x9.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/fpga/model/nv_ram_rwsp_16x65.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/fpga/model/nv_ram_rwsp_8x65.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/fpga/model/nv_ram_rws_256x3.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/fpga/model/nv_ram_rws_128x18.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/fpga/model/nv_ram_rws_512x128.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/fpga/model/nv_ram_rwsp_32x256.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/fpga/model/nv_ram_rwsp_8x129.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/fpga/model/nv_ram_rws_16x64.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/fpga/model/nv_ram_rwsthp_80x15.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/fpga/model/nv_ram_rwsp_256x14.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/fpga/model/nv_ram_rwsp_80x16.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/fpga/model/nv_ram_rws_32x32.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/fpga/model/nv_ram_rws_32x64.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/fpga/model/nv_ram_rws_64x256.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/fpga/model/nv_ram_rwsp_64x14.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/fpga/model/nv_ram_rwsthp_60x21.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/fpga/model/nv_ram_rwsp_128x6.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/fpga/model/nv_ram_rws_32x128.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/fpga/model/nv_ram_rws_32x544.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/fpga/model/nv_ram_rwsp_256x257.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/fpga/model/nv_ram_rwsp_80x514.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/fpga/model/nv_ram_rwsthp_80x36.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/fpga/model/nv_ram_rwsp_256x16.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/fpga/model/nv_ram_rwsthp_60x168.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/fpga/model/nv_ram_rws_32x512.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/fpga/model/nv_ram_rwsthp_20x8.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/fpga/model/nv_ram_rws_256x256.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/fpga/model/nv_ram_rws_32x256.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/fpga/model/nv_ram_rws_512x64.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/fpga/model/nv_ram_rws_32x768.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/fpga/model/nv_ram_rwsp_16x16.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/fpga/model/nv_ram_rws_256x512.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/fpga/model/nv_ram_rws_16x256.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/fpga/model/nv_ram_rwsp_160x514.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/fpga/model/nv_ram_rwsp_80x65.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/fpga/model/nv_ram_rwst_256x8.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/fpga/model/nv_ram_rws_64x128.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/fpga/model/nv_ram_rws_512x256.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/fpga/model/nv_ram_rwsp_128x257.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/fpga/model/nv_ram_rws_64x1024.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/model/RAMPDP_256X16_GL_M2_D2.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/model/RAMPDP_512X72_GL_M4_D2.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/model/RAMPDP_32X192_GL_M1_D2.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/model/RAMPDP_256X14_GL_M4_D2.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/model/RAMDP_20X16_GL_M1_E2.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/model/RAMPDP_256X11_GL_M4_D2.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/model/RAMPDP_80X16_GL_M2_D2.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/model/RAMDP_20X80_GL_M1_E2.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/model/RAMPDP_512X64_GL_M4_D2.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/model/RAMDP_20X32_GL_M1_E2.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/model/RAMPDP_64X160_GL_M1_D2.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/model/RAMPDP_128X32_GL_M2_D2.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/model/RAMPDP_128X18_GL_M2_D2.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/model/RAMDP_64X14_GL_M2_E2.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/model/RAMPDP_64X116_GL_M1_D2.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/model/RAMPDP_256X80_GL_M2_D2.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/model/RAMPDP_160X93_GL_M2_D2.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/model/RAMDP_16X256_GL_M1_E2.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/model/RAMDP_32X16_GL_M1_E2.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/model/RAMDP_64X32_GL_M1_E2.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/model/RAMDP_32X64_GL_M1_E2.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/model/RAMDP_20X288_GL_M1_E2.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/model/RAMPDP_64X288_GL_M1_D2.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/model/RAMDP_8X66_GL_M1_E2.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/model/RAMPDP_80X288_GL_M1_D2.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/model/RAMPDP_256X128_GL_M2_D2.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/model/RAMPDP_512X56_GL_M4_D2.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/model/RAMPDP_128X128_GL_M1_D2.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/model/RAMPDP_512X8_GL_M4_D2.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/model/RAMPDP_60X84_GL_M1_D2.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/model/RAMPDP_160X65_GL_M2_D2.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/model/RAMPDP_256X112_GL_M2_D2.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/model/RAMDP_8X258_GL_M1_E2.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/model/RAMPDP_128X288_GL_M1_D2.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/model/RAMPDP_512X40_GL_M4_D2.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/model/RAMDP_32X32_GL_M1_E2.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/model/RAMDP_128X11_GL_M2_E2.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/model/RAMDP_256X4_GL_M2_E2.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/model/RAMPDP_64X224_GL_M1_D2.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/model/RAMPDP_64X128_GL_M1_D2.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/model/RAMPDP_64X256_GL_M1_D2.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/model/RAMPDP_32X272_GL_M1_D2.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/model/RAMDP_16X272_GL_M1_E2.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/model/RAMDP_64X18_GL_M2_E2.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/model/RAMDP_256X7_GL_M2_E2.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/model/RAMPDP_32X288_GL_M1_D2.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/model/RAMDP_8X130_GL_M1_E2.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/model/RAMPDP_128X64_GL_M1_D2.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/model/RAMPDP_128X224_GL_M1_D2.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/model/RAMDP_60X22_GL_M1_E2.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/model/RAMPDP_32X130_GL_M1_D2.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/model/RAMPDP_60X168_GL_M1_D2.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/model/RAMPDP_160X82_GL_M2_D2.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/model/RAMPDP_160X144_GL_M2_D2.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/model/RAMDP_80X9_GL_M2_E2.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/model/RAMDP_16X66_GL_M1_E2.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/model/RAMDP_64X10_GL_M2_E2.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/model/RAMPDP_256X64_GL_M2_D2.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/model/RAMDP_20X8_GL_M1_E2.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/model/RAMPDP_128X60_GL_M1_D2.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/model/RAMDP_80X14_GL_M2_E2.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/model/RAMPDP_64X66_GL_M1_D2.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/model/RAMPDP_80X17_GL_M2_D2.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/model/RAMDP_16X64_GL_M1_E2.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/model/RAMPDP_80X72_GL_M1_D2.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/model/RAMPDP_64X130_GL_M1_D2.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/model/RAMPDP_248X144_GL_M2_D2.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/model/RAMPDP_64X226_GL_M1_D2.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/model/RAMPDP_80X36_GL_M1_D2.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/model/RAMPDP_128X256_GL_M1_D2.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/model/RAMPDP_80X226_GL_M1_D2.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/model/RAMDP_128X6_GL_M2_E2.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/model/RAMPDP_160X16_GL_M2_D2.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/model/RAMPDP_80X66_GL_M1_D2.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/model/RAMPDP_80X238_GL_M1_D2.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/model/RAMPDP_32X256_GL_M1_D2.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/model/RAMPDP_32X224_GL_M1_D2.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/model/RAMPDP_32X128_GL_M1_D2.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/model/RAMPDP_256X113_GL_M2_D2.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/model/RAMDP_80X15_GL_M2_E2.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/model/RAMDP_16X16_GL_M1_E2.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/model/RAMDP_256X8_GL_M2_E2.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/model/RAMPDP_64X64_GL_M1_D2.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/model/RAMDP_16X128_GL_M1_E2.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/model/RAMPDP_256X144_GL_M2_D2.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/model/RAMPDP_248X82_GL_M2_D2.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/model/RAMDP_64X16_GL_M2_E2.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/model/RAMDP_16X14_GL_M1_E2.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/model/RAMPDP_128X258_GL_M1_D2.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/model/RAMDP_80X18_GL_M1_E2.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/model/RAMPDP_80X256_GL_M1_D2.v
read_verilog -quiet ../outdir/nv_small/vmod/rams/model/RAMPDP_60X42_GL_M1_D2.v
read_verilog -quiet ../outdir/nv_small/vmod/vlibs/oneHotClk_async_read_clock.v
read_verilog -quiet ../outdir/nv_small/vmod/vlibs/p_SSYNC3DO_S_PPP.v
read_verilog -quiet ../outdir/nv_small/vmod/vlibs/HLS_fp16_to_fp32.v
read_verilog -quiet ../outdir/nv_small/vmod/vlibs/HLS_fp17_to_fp32.v
read_verilog -quiet ../outdir/nv_small/vmod/vlibs/p_STRICTSYNC3DOTM_C_PPP.v
read_verilog -quiet ../outdir/nv_small/vmod/vlibs/SDFSNQD1.v
read_verilog -quiet ../outdir/nv_small/vmod/vlibs/oneHotClk_async_write_clock.v
read_verilog -quiet ../outdir/nv_small/vmod/vlibs/sync2d_c_pp.v
read_verilog -quiet ../outdir/nv_small/vmod/vlibs/HLS_fp32_sub.v
read_verilog -quiet ../outdir/nv_small/vmod/vlibs/NV_BLKBOX_BUFFER.v
read_verilog -quiet ../outdir/nv_small/vmod/vlibs/PGAOPV_AN2D2PO4.v
read_verilog -quiet ../outdir/nv_small/vmod/vlibs/OR2D1.v
read_verilog -quiet ../outdir/nv_small/vmod/vlibs/NV_NVDLA_HLS_shiftleftsu.v
read_verilog -quiet ../outdir/nv_small/vmod/vlibs/NV_BLKBOX_SRC0_X.v
read_verilog -quiet ../outdir/nv_small/vmod/vlibs/CKLNQD12PO4.v
read_verilog -quiet ../outdir/nv_small/vmod/vlibs/HLS_fp16_to_fp17.v
read_verilog -quiet ../outdir/nv_small/vmod/vlibs/HLS_fp17_to_fp16.v
read_verilog -quiet ../outdir/nv_small/vmod/vlibs/sync3d_s_ppp.v
read_verilog -quiet ../outdir/nv_small/vmod/vlibs/NV_BLKBOX_SRC0.v
read_verilog -quiet ../outdir/nv_small/vmod/vlibs/SDFQD1.v
read_verilog -quiet ../outdir/nv_small/vmod/vlibs/SDFCNQD1.v
read_verilog -quiet ../outdir/nv_small/vmod/vlibs/NV_NVDLA_HLS_shiftrightsatsu.v
read_verilog -quiet ../outdir/nv_small/vmod/vlibs/HLS_uint16_to_fp17.v
read_verilog -quiet ../outdir/nv_small/vmod/vlibs/p_SSYNC3DO.v
read_verilog -quiet ../outdir/nv_small/vmod/vlibs/sync_reset.v
read_verilog -quiet ../outdir/nv_small/vmod/vlibs/NV_NVDLA_HLS_shiftrightss.v
read_verilog -quiet ../outdir/nv_small/vmod/vlibs/HLS_fp32_mul.v
read_verilog -quiet ../outdir/nv_small/vmod/vlibs/NV_NVDLA_HLS_shiftrightusz.v
read_verilog -quiet ../outdir/nv_small/vmod/vlibs/sync3d_c_ppp.v
read_verilog -quiet ../outdir/nv_small/vmod/vlibs/CKLNQD12.v
read_verilog -quiet ../outdir/nv_small/vmod/vlibs/NV_NVDLA_HLS_shiftrightsu.v
read_verilog -quiet ../outdir/nv_small/vmod/vlibs/PGAOPV_DFCNQD2PO4.v
read_verilog -quiet ../outdir/nv_small/vmod/vlibs/MUX2D4.v
read_verilog -quiet ../outdir/nv_small/vmod/vlibs/HLS_fp17_mul.v
read_verilog -quiet ../outdir/nv_small/vmod/vlibs/NV_DW_lsd.v
read_verilog -quiet ../outdir/nv_small/vmod/vlibs/p_SDFCNQD1PO4.v
read_verilog -quiet ../outdir/nv_small/vmod/vlibs/HLS_fp17_sub.v
read_verilog -quiet ../outdir/nv_small/vmod/vlibs/HLS_fp32_add.v
read_verilog -quiet ../outdir/nv_small/vmod/vlibs/HLS_fp17_add.v
read_verilog -quiet ../outdir/nv_small/vmod/vlibs/HLS_fp32_to_fp17.v
read_verilog -quiet ../outdir/nv_small/vmod/vlibs/PGAOPV_INVD2PO4.v
read_verilog -quiet ../outdir/nv_small/vmod/vlibs/NV_CLK_gate_power.v
read_verilog -quiet ../outdir/nv_small/vmod/vlibs/NV_DW02_tree.v
read_verilog -quiet ../outdir/nv_small/vmod/vlibs/LNQD1PO4.v
read_verilog -quiet ../outdir/nv_small/vmod/vlibs/HLS_cdp_icvt.v
read_verilog -quiet ../outdir/nv_small/vmod/vlibs/HLS_cdp_ocvt.v
read_verilog -quiet ../outdir/nv_small/vmod/vlibs/NV_DW_minmax.v
read_verilog -quiet ../outdir/nv_small/vmod/vlibs/NV_NVDLA_HLS_saturate.v
read_verilog -quiet ../outdir/nv_small/vmod/vlibs/HLS_fp32_to_fp16.v
read_verilog -quiet ../outdir/nv_small/vmod/vlibs/sync3d.v
read_verilog -quiet ../outdir/nv_small/vmod/vlibs/ScanShareSel_JTAG_reg_ext_cg.v
read_verilog -quiet ../outdir/nv_small/vmod/vlibs/p_SSYNC3DO_C_PPP.v
read_verilog -quiet ../outdir/nv_small/vmod/vlibs/NV_BLKBOX_SINK.v
read_verilog -quiet ../outdir/nv_small/vmod/vlibs/p_SSYNC2DO_C_PP.v
read_verilog -quiet ../outdir/nv_small/vmod/vlibs/AN2D4PO4.v
read_verilog -quiet ../outdir/nv_small/vmod/vlibs/NV_NVDLA_CDP_HLS_ocvt.v
read_verilog -quiet ../outdir/nv_small/vmod/vlibs/NV_NVDLA_CDP_HLS_icvt.v
read_verilog -quiet ../outdir/nv_small/vmod/vlibs/MUX2HDD2.v


##############################################################


read_xdc nvdla_constraints.xdc
# synth_design -top NV_nvdla -part xczu7ev-ffvc1156-2-e -verilog_define DESIGNWARE_NOEXIST=1 -verilog_define VIVADO=1 -verilog_define NV_FPGA_SYSTEM=1 -verilog_define NVTOOLS_SYNC2D_GENERIC_CELL=1 -verilog_define NO_PERFMON_HISTOGRAM=1 -verilog_define PRAND_OFF=1
# synth_design -top NV_nvdla -part xczu7ev-ffvc1156-2-e -verilog_define DESIGNWARE_NOEXIST=1 -verilog_define NV_FPGA_SYSTEM=1 -constrset constrs_1 -include_dirs {../outdir/nv_small/vmod/include/ ../outdir/nv_small/vmod/vlibs/}


# nv_small: 2hrs, 46mins
# 
# update part? xc7vx485tffg1157-1 (ZCU104)
synth_design -top NV_nvdla \
-part xczu7ev-ffvc1156-2-e \
-verilog_define DISABLE_TESTPOINTS=1 \
-verilog_define NV_SYNTHESIS=1 \
-verilog_define RAM_INTERFACE=1 \
-verilog_define SYNTHESIS=1 \
-verilog_define FPGA=1 \
-verilog_define DESIGNWARE_NOEXIST=1 \
-verilog_define VLIB_BYPASS_POWER_CG=1 \
-verilog_define NV_FPGA_FIFOGEN=1 \
-verilog_define FIFOGEN_MASTER_CLK_GATING_DISABLED=1 \
-verilog_define RAM_DISABLE_POWER_GATING_FPGA=1 \
-verilog_define NV_FPGA_SYSTEM=1 \
-verilog_define VIVADO=1 \
-constrset constrs_1
# -verilog_define NO_PERFMON_HISTOGRAM=1 \
# -verilog_define PRAND_OFF=1 \
# -verilog_define NVTOOLS_SYNC2D_GENERIC_CELL=1 \
# -include_dirs {../outdir/nv_small/vmod/include/ ../outdir/nv_small/vmod/vlibs/}


# synth_design -top NV_nvdla -part xczu7ev-ffvc1156-2-e -verilog_define DESIGNWARE_NOEXIST=1 -verilog_define NV_FPGA_SYSTEM=1 -verilog_define VIVADO=1 -verilog_define NVTOOLS_SYNC2D_GENERIC_CELL=1 -verilog_define NO_PERFMON_HISTOGRAM=1 -verilog_define PRAND_OFF=1 -constrset constrs_1

write_verilog NV_nvdla_small_netlist.v
write_edf NV_nvdla_small_netlist.edf